<template>
  <div>
    <div class="container terms">
      <div class="alert">
        <p class="title">用户协议</p>
        <p>
          尊敬的用户，欢迎使用由MOTD平台（下列简称为“MOTD”）提供的服务。在使用前请您阅读如下服务协议，使用本应用即表示您同意接受本协议，本协议产生法律效力，特别涉及免除或者限制MOTD责任的条款，请仔细阅读。如有任何问题，可向MOTD咨询。
        </p>

        <p>1. 服务条款的确认和接受</p>
        <p>通过访问或使用本应用，表示用户同意接受本协议的所有条件和条款。</p>
        <p>2. 服务条款的变更和修改</p>
        <p>
          MOTD有权在必要时修改服务条款，服务条款一旦发生变更，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以放弃获得的本应用信息服务。如果用户继续享用本应用的信息服务，则视为接受服务条款的变更。本应用保留随时修改或中断服务而不需要通知用户的权利。本应用行使修改或中断服务的权利，不需对用户或第三方负责。
        </p>
        <p>3. 用户行为（禁止）</p>
        <p>
          （1）使用党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名于MOTD平台所连接的客户端内；
        </p>
        <p>（2）冒充他人，未经过允许替代他人进行平台内相关申请；</p>
        <p>4. 上传或发布的内容</p>
        <p>
          用户上传的内容是指用户在MOTD上传或发布的视频或其它任何形式的内容包括文字、图片、音频等。除非MOTD收到相关通知，否则MOTD将用户视为其在本应用上传或发布的内容的版权拥有人。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。MOTD不承担任何法律及连带责任。
        </p>
        <p>
          对于经由本应用而传送的内容，MOTD不保证前述其合法性、正当性、准确性、完整性或品质。用户在使用本应用时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，MOTD均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。MOTD有权（但无义务）自行拒绝或删除经由本应用提供的任何内容。
        </p>
        <p>
          个人或单位如认为MOTD存在侵犯自身合法权益的内容，应准备好具有法律效应的证明材料，及时与MOTD取得联系，以便MOTD迅速作出处理。
        </p>
        <p>隐私条款</p>
        <p>1.用户信息公开情况说明</p>
        <p>
          尊重用户个人隐私是MOTD的一项基本政策。所以，MOTD不会在未经合法用户授权时公开、编辑或透露其注册资料及保存在本应用中的非公开内容，除非有下列情况：
        </p>
        <p>（1）有关法律规定或MOTD合法服务程序规定；</p>
        <p>（2）在紧急情况下，为维护用户及公众的权益；</p>
        <p>（3）为维护MOTD的商标权、专利权及其他任何合法权益；</p>
        <p>（4）其他需要公开、编辑或透露个人信息的情况；</p>
        <p>在以下（包括但不限于）几种情况下，MOTD有权使用用户的个人信息：</p>
        <p>
          （1）在进行促销或抽奖时，MOTD可能会与赞助商共享用户的个人信息，在这些情况下MOTD会在发送用户信息之前进行提示，并且用户可以通过不参与来终止传送过程；
        </p>
        <p>（2）MOTD可以将用户信息与第三方数据匹配；</p>
        <p>
          （3）MOTD会通过透露合计用户统计数据，向未来的合作伙伴、广告商及其他第三方以及为了其他合法目的而描述MOTD的服务；
        </p>
        <p>2.隐私权政策适用范围</p>
        <p>（1）用户在登录本应用服务器时留下的个人身份信息；</p>
        <p>（2）用户通过本应用服务器与其他用户或非用户之间传送的各种资讯；</p>
        <p>（3）本应用与商业伙伴共享的其他用户或非用户的各种信息；</p>
        <p>3.资讯公开与共享</p>
        <p>
          MOTD不会将用户的个人信息和资讯故意透露、出租或出售给任何第三方。但以下情况除外：
        </p>
        <p>（1）用户本人同意与第三方共享信息和资讯;</p>
        <p>
          （2）只有透露用户的个人信息和资讯，才能提供用户所要求的某种产品和服务;
        </p>
        <p>
          （3）应代表本应用提供产品或服务的主体的要求提供（除非我们另行通知，否则该等主体无权将相关用户个人信息和资讯用于提供产品和服务之外的其他用途）：根据法律法规或行政命令的要求提供;因外部审计需要而提供;用户违反了本应用服务条款或任何其他产品及服务的使用规定;经本站评估，用户的帐户存在风险，需要加以保护。
        </p>
        <p>4.Cookies、日志档案和webbeacon</p>
        <p>
          通过使用cookies，本应用向用户提供简单易行并富个性化的网络体验。cookies能帮助我们确定用户连接的页面和内容，并将该等信息储存。我们使用自己的cookies和webbeacon，用于以下用途：
        </p>
        <p>
          （1）记住用户身份。例如：cookies和webbeacon有助于我们辨认用户作为我们的注册用户的身份，或保存用户向我们提供有关用户的喜好或其他信息；
        </p>
        <p>
          （2）分析用户使用我们服务的情况。我们可利用cookies和webbeacon来了解用户使用我们的服务进行什么活动、或哪些网页或服务最受欢迎；
          我们为上述目的使用cookies和webbeacon的同时，可能将通过cookies和webbeacon收集的非个人身份信息汇总提供给广告商和其他伙伴，用于分析您和其他用户如何使用我们的服务并用于广告服务。用户可以通过浏览器或用户选择机制拒绝或管理cookies或webbeacon。但请用户注意，如果用户停用cookies或webbeacon，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。
        </p>
        <p>
          （3）当你使用本站的服务时，我们的主机会自动记录用户的浏览器在访问网站时所发送的信息和资讯。主机日志资讯包括但不限于用户的网路请求、IP地址、浏览器类型、浏览器使用的语言、请求的日期和时间，以及一个或多个可以对用户的浏览器进行辨识的cookie。
        </p>
        <p>5.服务器记录删除申请</p>
        <p>
          用户有权在任何时候编辑用户在MOTD的帐户信息和资讯，用户也可以填写相关申请表格，要求删除个人帐户，但是用户无条件同意在你的帐户删除后，该帐户内及与该帐户相关的信息和资讯仍然保留在本网站档案记录中，除上述第三条规定的情况外，MOTD将为用户保密。
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Terms",

  data: () => ({}),
};
</script>

<style scoped>
.container.terms {
  margin: 10px auto 20px auto;
  border-radius: 5px 5px 0 0;
  width: 90%;
  max-width: 1000px;
  cursor: default;
}

.alert {
    padding: 15px 10px;
    color: #fff;
    background: rgba(20, 20, 20, 0.85);
    border: 4px solid #fff;
    border-radius: 16px;
    border-image-width: 6px;
    border-image-repeat: repeat;
    border-image-slice: 4;
    border-image-source: url("https://cdn.jsdelivr.net/gh/pluginskers/ImgBed/ImgBedalert.png");
    -webkit-box-shadow: 0 0 4px 0 rgb(0 0 0 / 50%);
    box-shadow: 0 0 4px 0 rgb(0 0 0 / 50%);
}
</style>
